### [Part 1] Task 03. Import your analysis libraries, as well as your new customer data set as a dataframe

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# Set path 
path = r'C:\Users\lecce\OneDrive\Achievement 4 - Python\02 Data'

In [4]:
# Import new customer data set from the 'Original Data' folder as a dataframe
customers = pd.read_csv(os.path.join(path,'og data', 'customers.csv'))

In [5]:
# Preview the newly imported dataframe 
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [6]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
# Check the dimensions of the dataframe
customers.shape

(206209, 10)

In [8]:
# View descriptive statistics 
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [9]:
# Check data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

### [Part 1] Task 04. Wrangle the data so that it follows consistent logic

In [11]:
# Rename the columns to establish uniformity
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [12]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [13]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [14]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [15]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [16]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [17]:
# Check columns
customers.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

In [18]:
# The columns have been successfully renamed and are now uniform and clear

In [19]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [20]:
# In terms of dropping columns, I think analysis for each of these columns is possible and effective

### [Part 1] Task 05. Complete the fundamental data quality and consistency checks

In [22]:
# Address data-types and potential mixed data-types in the dataframe
customers.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [23]:
# Checking for mixed data-types in each column
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [24]:
# The output revealed that the 'first_name' column has mixed data-types that need to be addressed
customers['first_name'] = customers['first_name'].astype('str')

In [25]:
# The 'user_id' column, while not containing mixed data-types, is still improperly listed as an integer
customers['user_id'] = customers['user_id'].astype('str')

In [26]:
# Re-check the data-types in the data frame and for mixed data-types
customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [27]:
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

In [28]:
# Check for missing data
customers.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [29]:
# Check for full-duplicates
customers_dups = customers[customers.duplicated()]

In [30]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [31]:
# Perform a descriptive statistic check to ensure everything looks normal
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [32]:
# There's nothing unusual present in the descriptive statistics

### [Part 1] Task 06. Combine your customer data with the rest of your prepared Instacart data

In [34]:
import pandas as pd

file_path = "C:\\Users\\lecce\\OneDrive\\Achievement 4 - Python\\02 Data\\prepared data\\ords_prods_merge.csv"
df = pd.read_csv(file_path)

In [35]:
# Check the shape of the newly imported dataframe
df.shape

(32404859, 25)

In [36]:
# Check the shape of the customers dataframe
customers.shape

(206209, 10)

In [37]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 25 columns):
 #   Column                      Dtype
---  ------                      -----
 0   Unnamed: 0                  int64
 1   product_id                  int64
 2   product_name                object
 3   aisle_id                    int64
 4   department_id               int64
 5   prices                      float64
 6   order_id                    int64
 7   user_id                     int64
 8   eval_set                    object
 9   order_number                int64
 10  orders_day_of_week          int64
 11  order_hour_of_day           int64
 12  days_since_prior_order      float64
 13  orders_hour_of_day          int64
 14  add_to_cart_order           int64
 15  reordered                   int64
 16  busiest_day                 object
 17  busiest_days                object
 18  busiest_period_of_day       object
 19  max_order                   int64
 20  loyalty_flag                object
 21  mean_product_price          float64
 22  spending_flag               object
 23  median_days_between_orders  float64
 24  order_frequency             object
dtypes: float64(4), int64(13), object(8)
memory usage: 6.0+ GB

In [39]:
df = df.astype({col: 'int32' for col in df.select_dtypes(include='int64').columns})

In [40]:
df = df.astype({col: 'float32' for col in df.select_dtypes(include='float64').columns})

In [41]:
object_columns = df.select_dtypes(include=['object']).columns
df[object_columns] = df[object_columns].astype('category')

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 25 columns):
 #   Column                      Dtype
---  ------                      -----
 0   Unnamed: 0                  int32
 1   product_id                  int32
 2   product_name                category
 3   aisle_id                    int32
 4   department_id               int32
 5   prices                      float32
 6   order_id                    int32
 7   user_id                     int32
 8   eval_set                    category
 9   order_number                int32
 10  orders_day_of_week          int32
 11  order_hour_of_day           int32
 12  days_since_prior_order      float32
 13  orders_hour_of_day          int32
 14  add_to_cart_order           int32
 15  reordered                   int32
 16  busiest_day                 category
 17  busiest_days                category
 18  busiest_period_of_day       category
 19  max_order                   int32
 20  loyalty_flag                category
 21  mean_product_price          float32
 22  spending_flag               category
 23  median_days_between_orders  float32
 24  order_frequency             category
dtypes: category(8), float32(4), int32(13)
memory usage: 2.4 GB

In [43]:
# Both dataframes share the 'user_id' column
# Check data-type of shared column
orders_products.dtypes['user_id']

NameError: name 'orders_products' is not defined

In [44]:
customers.dtypes['user_id']

dtype('O')

In [46]:
# Make sure both key columns are the same data type
df['user_id'] = df['user_id'].astype('str')

In [47]:
df.dtypes['user_id']

dtype('O')

In [ ]:
# The key columns now have matching data-types

In [50]:
# Drop the existing '_merge' column from previous exercises
df = df.drop(columns=['_merge'])

KeyError: "['_merge'] not found in axis"

In [ ]:
# Merge the two dataframes using the column 'user_id' as the shared column with the default join (inner)

In [52]:
df_customer_9 = df.merge(customers, on = 'user_id', indicator = True)

In [ ]:
# This new dataframe combines both the customers and orders_products dataframes and uses the 'user_id' column as its key

In [55]:
# Check shape of newly merged dataframe
df_customer_9.shape

(32404859, 35)

In [57]:
df_customer_9.head(5)

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,eval_set,order_number,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,prior,28,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,prior,30,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,prior,2,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,prior,1,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,prior,3,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

In [59]:
# Check inner join value counts
df_customer_9['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [61]:
# Check data-types
df_customer_9.dtypes

Unnamed: 0                       int32
product_id                       int32
product_name                  category
aisle_id                         int32
department_id                    int32
prices                         float32
order_id                         int32
user_id                         object
eval_set                      category
order_number                     int32
orders_day_of_week               int32
order_hour_of_day                int32
days_since_prior_order         float32
orders_hour_of_day               int32
add_to_cart_order                int32
reordered                        int32
busiest_day                   category
busiest_days                  category
busiest_period_of_day         category
max_order                        int32
loyalty_flag                  category
mean_product_price             float32
spending_flag                 category
median_days_between_orders     float32
order_frequency               category
first_name                      object
surname                         object
gender                          object
state                           object
age                              int64
date_joined                     object
n_dependants                     int64
marital_status                  object
income                           int64
_merge                        category
dtype: object

In [63]:
# The 'order_id' column also has the wrong data type, so let's fix it
df_customer_9['order_id'] = df_customer_9['order_id'].astype('str')

In [64]:
df_customer_9.dtypes

Unnamed: 0                       int32
product_id                       int32
product_name                  category
aisle_id                         int32
department_id                    int32
prices                         float32
order_id                        object
user_id                         object
eval_set                      category
order_number                     int32
orders_day_of_week               int32
order_hour_of_day                int32
days_since_prior_order         float32
orders_hour_of_day               int32
add_to_cart_order                int32
reordered                        int32
busiest_day                   category
busiest_days                  category
busiest_period_of_day         category
max_order                        int32
loyalty_flag                  category
mean_product_price             float32
spending_flag                 category
median_days_between_orders     float32
order_frequency               category
first_name                      object
surname                         object
gender                          object
state                           object
age                              int64
date_joined                     object
n_dependants                     int64
marital_status                  object
income                           int64
_merge                        category
dtype: object

### [Part 1] Task 08. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task

In [81]:
df_customer_9_path = os.path.join(path, 'prepared data', 'df_customer_9.pkl')

In [83]:
df_customer_9.to_pickle(df_customer_9_path)